In [2]:
import numpy as np
import pandas as pd

In [3]:
dict = {"A" : [1, 5, 2], "B" : [4, np.nan, 2], "C" : [np.nan, np.nan, 7]}
dict

{'A': [1, 5, 2], 'B': [4, nan, 2], 'C': [nan, nan, 7]}

In [5]:
df = pd.DataFrame(dict)
df

   A    B    C
0  1  4.0  NaN
1  5  NaN  NaN
2  2  2.0  7.0

In [8]:
#dropna() drops the row/column which has atleast one null
# df.dropna(axis= 1)
df.dropna()

   A    B    C
2  2  2.0  7.0

In [11]:
df.dropna(thresh=2) #drops those who have 2 or more null values

   A    B    C
0  1  4.0  NaN
2  2  2.0  7.0

In [15]:
df

   A    B    C
0  1  4.0  NaN
1  5  NaN  NaN
2  2  2.0  7.0

In [16]:
#replace null values
df["C"].fillna(value= df["A"].mean())

0    2.666667
1    2.666667
2    7.000000
Name: C, dtype: float64

In [18]:
#group by

data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [29]:
byComp = df.groupby("Company")
byComp

In [33]:
byComp.sum()

             Person  Sales
Company
FB        CarlSarah    593
GOOG     SamCharlie    320
MSFT     AmyVanessa    464

In [35]:
df.groupby("Company").describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0